snlkuharlocal/src/Documents/ЗапросКодовМаркировки/ЗапросКодовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапросКодовМаркировки</name>
  <basedOn>Catalog.Номенклатура</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументовМаркировки</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГТИН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СтатусыДокументовМаркировки/СтатусыДокументовМаркировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовМаркировки</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтложеннойОбработки</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обрабатывается</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОбработанЧЗ</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЧЗ</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СпособыВводаВОборотСУЗ/СпособыВводаВОборотСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыВводаВОборотСУЗ</name>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Импорт</name>
  </enumValues>
  <enumValues>
    <name>МаркировкаОстатков</name>
  </enumValues>
  <enumValues>
    <name>ТрансграничнаяТорговля</name>
  </enumValues>
  <enumValues>
    <name>Перемаркировка</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
  <enumValues>
    <name>ПокупкаВРФ</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтатусыДоков_Маркировка/СтатусыДоков_Маркировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоков_Маркировка</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ПолучениеКодов</name>
  </enumValues>
  <enumValues>
    <name>КодыПолучены</name>
  </enumValues>
  <enumValues>
    <name>ФормированиеАТК</name>
  </enumValues>
  <enumValues>
    <name>АТКСформирован</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
  <enumValues>
    <name>ВыпущеноТаможней</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗапросКодовМаркировки/ObjectModule.bsl
#Область СобытияОбъекта

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);
	КонецЕсли; 
	Префикс = Префикс+Маркировка_ПИ.ЭтотУзел_Код("Основной") + "-";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)	
	Статус				= Перечисления.СтатусыДокументовМаркировки.ВРаботе;
	Автор 				= ПараметрыСеанса.Пользователь;	
	//Валетов + 21,02,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#MARK-3522
	//СпособВводаВОборот 	= Перечисления.СпособыВводаВОборотСУЗ.МаркировкаОстатков; 
	СпособВводаВОборот 	= Перечисления.СпособыВводаВОборотСУЗ.Перемаркировка;
	//Валетов -
	Основание	= ДанныеЗаполнения;
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда Возврат КонецЕсли;
	ТипОснования 		= ТипЗнч(Основание);		
	
	СтрокаРеквизитов = "Дата,Организация,Комментарий";
	Если ТипОснования	= Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		Организация		= ПолучитьРеквизитШапки(Основание, "Организация");	
	КонецЕсли;	
	
	Если ТипОснования = Тип("СправочникСсылка.Номенклатура") Тогда
		ЗаполнитьТоварыПоСправочнику(Основание);
	ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда				
		ЗаполнитьТоварыПоНакладной(Основание);		
	КонецЕсли;
	
	Дата = ТекущаяДата();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Статус = Перечисления.СтатусыДоков_Маркировка.ВРаботе;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	ЗаписатьГТИНвНоменклатуру();	
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьТоварыПоСправочнику(Основание)
	Запрос=Новый ("Запрос");
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура
	|ГДЕ
	|	Ссылка В ИЕРАРХИИ (&Основание)
	|	И НЕ ЭтоГруппа
	|	И ГТИН = """"
	|УПОРЯДОЧИТЬ ПО
	|	Родитель.Наименование,
	|	Наименование
	|";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Товары.Очистить();
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры //ЗаполнитьТоварыПоСправочнику(Основание)

Процедура ЗаполнитьТоварыПоНакладной(Основание)	
	Запрос = Новый ("Запрос");
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура
	|ИЗ
	|	Документ.ПриходнаяНакладная.Товары
	|ГДЕ
	|	Ссылка = &Основание	
	|	И Номенклатура.ГТИН = """"
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Родитель.Наименование,
	|	Номенклатура.Наименование
	|";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Товары.Очистить();
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры //ЗаполнитьТоварыПоСправочнику(Основание)

Процедура ЗаписатьГТИНвНоменклатуру()
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Номенклатура,
	|	ГТИН
	|ИЗ
	|	Документ.ЗапросКодовМаркировки.Товары КАК ТЧ_Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|	И Номенклатура.ГТИН <> ТЧ_Товары.ГТИН
	|";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СпрОбъект 		= Выборка.Номенклатура.ПолучитьОбъект();					
		СпрОбъект.ГТИН	= Выборка.ГТИН;
		
		СпрОбъект.Записать();		
		
		#ЕСЛИ КЛИЕНТ ТОГДА
		ОповеститьОбИзменении(Выборка.Номенклатура);
		#КОНЕЦЕСЛИ
	КонецЦикла;
КонецПроцедуры
